// Визначення параметрів тестового сценарію
double minDist = 10; // мінімальна відстань між локаціями ВДЕ
double budget = 10; // загальний бюджет

// Визначення координат локацій
double[,] locations = new double[,]
{
            { 18, 71 },  // Локація 1
            { 28, 71 },  // Локація 2
            { 25, 64.11508 },  // Локація 3
            { 28, 71.3588 },  // Локація 4
};

// Визначення вартості установки для кожного ВДЕ в кожній локації
double[,] costs = new double[,]
{
            { 114, 117, 117, 112, 100 },
            { 5, 4, 6, 7, 7 },
            { 41, 84, 77, 53, 100 },
            { 41, 84, 77, 53, 100 }
};

// Визначення потужності кожного ВДЕ в кожній локації
double[,] powers = new double[,]
{
            { 112, 107, 118, 118, 100 },
            { 70, 32, 16, 85, 22 },
            { 48, 34, 94, 27, 100 },
            { 112, 107, 118, 118, 100 }
};

double evaporationRate = 0.05;  // Швидкість випаровування феромону

// Створення екземпляра алгоритму
var aco = new AntColonyOptimization(locations, costs, powers, budget, minDist, evaporationRate);
aco.Optimize(20, 100);  // Запуск оптимізації з 20 мурашками та 100 ітераціями
